[
  {
      "bookId": 1,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/0K0dfYB/pngwing-1.png",
      "review": "A classic novel that explores the themes of identity, belonging, loss, and connection. The protagonist, Holden Caulfield, is a teenager who grapples with the harsh realities of growing up in a world that he finds phony and superficial. The novel is a powerful exploration of the human condition, and it continues to resonate with readers more than half a century after its publication.",
      "totalPages": 277,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Coming of Age", "Realistic Fiction"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
  },
  {
      "bookId": 2,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/6JsML90/kindpng-7318921.png",
      "review": "A powerful novel that explores issues of racism, morality, and social inequality. The story is set in the American South during the Great Depression, and it follows the journey of a young girl named Scout Finch as she learns about the world around her. The novel is a poignant examination of the human capacity for both good and evil, and it remains a beloved classic of American literature.",
      "totalPages": 324,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Courtroom Drama", "Gothic"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
  },
  {
      "bookId": 3,
      "bookName": "The Hate You Give",
      "author": "George Orwell",
      "image": "https://i.ibb.co/KLVgYfW/kindpng-1064993.png",
      "review": "A dystopian novel that explores the dangers of totalitarianism and state surveillance. The story is set in a world where the government, led by the enigmatic Big Brother, has complete control over every aspect of people's lives. The novel is a chilling warning about the dangers of giving up personal freedoms for the sake of security, and it remains as relevant today as it was when it was first published in 1949.",
      "totalPages": 328,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["Dystopia", "Political Fiction"],
      "publisher": "Secker and Warburg",
      "yearOfPublishing": 1949
  },
  {
      "bookId": 4,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/W3Z1km4/kindpng-4022054-1.png",
      "review": "A classic novel that explores the themes of wealth, love, and the American Dream. The story is set in the Roaring Twenties, and it follows the journey of a young man named Nick Carraway as he becomes embroiled in the world of his wealthy neighbor, Jay Gatsby. The novel is a powerful critique of the excesses of the Jazz Age, and it remains a classic of American literature.",
      "totalPages": 180,
      "rating": 4.2,
      "category": "Fiction",
      "tags": ["Tragedy", "Social Commentary"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
  },
  {
      "bookId": 5,
      "bookName":"Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/M1fFzDR/kindpng-81724-1.png",
      "review": "A classic romance novel that explores the themes of love, marriage, and social class. The story is set in early 19th century England, and it follows the lives of the Bennett sisters as they navigate the world of courtship and social expectations. The novel is a witty and insightful commentary on the role of women in society, and it remains a beloved classic of English literature.",
      "totalPages": 238,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["Romance", "Satire"],
      "publisher": "T. Egerton",
      "yearOfPublishing": 1813
  },
  {
      "bookId": 6,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/tHfMb7h/kindpng-2193744-1.png",
      "review": "A classic fantasy novel that follows the journey of a hobbit named Bilbo Baggins. The story is set in the world of Middle-earth, and it follows Bilbo as he embarks on a dangerous adventure with a group of dwarves to reclaim their lost treasure. The novel is a thrilling and enchanting tale of adventure, and it remains a beloved classic of fantasy literature.",
      "totalPages": 310,
      "rating": 4.5,
      "category": "Fantasy",
      "tags": ["Adventure", "High Fantasy"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
  },
  {
      "bookId": 7,
      "bookName": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/BVnnBQq/kindpng-5624060-1-1.png",
      "review": "A classic epic fantasy novel that tells the story of the War of the Ring. The story is set in the world of Middle-earth, and it follows a group of hobbits as they embark on a dangerous mission to destroy the One Ring. The novel is a sweeping and epic tale of adventure, and it remains a beloved classic of fantasy literature.",
      "totalPages": 1178,
      "rating": 4.7,
      "category": "Fantasy",
      "tags": ["Epic", "High Fantasy"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1954
  },
  {
      "bookId": 8,
      "bookName": "The Hunger Games",
      "author": "Suzanne Collins",
      "image": "https://i.ibb.co/6mD54z7/kindpng-2592315-1.png",
      "review": "A dystopian novel that follows the journey of a girl named Katniss Everdeen. The story is set in a future world where the Capitol controls every aspect of life in the twelve districts of Panem. The novel is a thrilling and action-packed tale of survival, and it explores themes of power, identity, and rebellion.",
      "totalPages": 374,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Dystopia", "Adventure"],
      "publisher": "Scholastic Corporation",
      "yearOfPublishing": 2008
  },
  {
      "bookId": 9,
      "bookName": "Harry Potter and the Philosopher's Stone",
      "author": "J.K. Rowling",
      "image": "https://i.ibb.co/6BW2KL6/kindpng-4945926-1.png",
      "review": "A classic fantasy novel that follows the story of ayoung boy named Harry Potter. The story is set in the world of magic, where Harry discovers that he is a wizard and embarks on a dangerous journey to Hogwarts School of Witchcraft and Wizardry. The novel is a thrilling and enchanting tale of adventure, and it remains a beloved classic of fantasy literature.",
      "totalPages": 223,
      "rating": 4.6,
      "category": "Fantasy",
      "tags": ["Adventure", "Fantasy"],
      "publisher": "Bloomsbury",
      "yearOfPublishing": 1997
  }
]